public/posts/how-will-we-know-it-works/index.html
<!DOCTYPE html>
<html lang="en">
<head>  
    <title>How will we know it works? :: The Programmer&#39;s Stone</title>
  
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content=" This article is part of the series JEG2&#39;s Questions.
do achieve product&#39;s roadmap, but don&#39;t blindly grind through tickets
" />
<meta name="keywords" content="" />

  <meta name="robots" content="noodp" />

<link rel="canonical" href="http://localhost:1313/posts/how-will-we-know-it-works/" />





  
  <link rel="stylesheet" href="http://localhost:1313/css/buttons.min.86f6b4c106b6c6eb690ae5203d36b442c1f66f718ff4e8164fa86cf6c61ad641.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/code.min.d529ea4b2fb8d34328d7d31afc5466d5f7bc2f0bc9abdd98b69385335d7baee4.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/fonts.min.5bb7ed13e1d00d8ff39ea84af26737007eb5051b157b86fc24487c94f3dc8bbe.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/footer.min.eb8dfc2c6a7eafa36cd3ba92d63e69e849e2200e0002a228d137f236b09ecd75.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/gist.min.a751e8b0abe1ba8bc53ced52a38b19d8950fe78ca29454ea8c2595cf26aad5c0.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/header.min.75c7eb0e2872d95ff48109c6647d0223a38db52e2561dd87966eb5fc7c6bdac6.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/main.min.36833afd348409fc6c3d09d0897c5833d9d5bf1ff31f5e60ea3ee42ce2b1268c.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/menu.min.3c17467ebeb3d38663dce68f71f519901124fa5cbb4519b2fb0667a21e9aca39.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/pagination.min.bbb986dbce00a5ce5aca0504b7925fc1c581992a4bf57f163e5d69cc1db7d836.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/post.min.e6dddd258e64c83e05cec0cd49c05216742d42fc8ecbfbe6b67083412b609bd3.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/syntax.min.a0773cce9310cb6d8ed23e50f005448facf29a53001b57e038828daa466b25c0.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/terminal.min.e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855.css">

  
  <link rel="stylesheet" href="http://localhost:1313/css/terms.min.b81791663c3790e738e571cdbf802312390d30e4b1d8dc9d814a5b5454d0ac11.css">


<link rel="stylesheet" href="http://localhost:1313/terminal.css">




<link rel="shortcut icon" href="http://localhost:1313/favicon.png">
<link rel="apple-touch-icon" href="http://localhost:1313/apple-touch-icon.png">


<meta name="twitter:card" content="summary" />



<meta property="og:locale" content="en" />
<meta property="og:type" content="article" />
<meta property="og:title" content="How will we know it works?">
<meta property="og:description" content=" This article is part of the series JEG2&#39;s Questions.
do achieve product&#39;s roadmap, but don&#39;t blindly grind through tickets
" />
<meta property="og:url" content="http://localhost:1313/posts/how-will-we-know-it-works/" />
<meta property="og:site_name" content="The Programmer&#39;s Stone" />

  <meta property="og:image" content="http://localhost:1313/og-image.png">

<meta property="og:image:width" content="1200">
<meta property="og:image:height" content="627">


  <meta property="article:published_time" content="2025-08-04 00:00:00 &#43;0000 UTC" />












</head>
<body>


<div class="container center">

  <header class="header">
  <div class="header__inner">
    <div class="header__logo">
      <a href="http://localhost:1313/">
  <div class="logo">
    The Programmer&#39;s Stone
  </div>
</a>

    </div>
    
      <ul class="menu menu--mobile">
  <li class="menu__trigger">Menu&nbsp;▾</li>
  <li>
    <ul class="menu__dropdown">
      
        
          <li><a href="http://localhost:1313/about">About</a></li>
        
      
      
    </ul>
  </li>
</ul>

    
    
  </div>
  
    <nav class="navigation-menu">
  <ul class="navigation-menu__inner menu--desktop">
    
      
        
          <li><a href="http://localhost:1313/about" >About</a></li>
        
      
      
    
  </ul>
</nav>

  
</header>


  <div class="content">
    
<article class="post">
  <h1 class="post-title">
    <a href="http://localhost:1313/posts/how-will-we-know-it-works/">How will we know it works?</a>
  </h1>
  <div class="post-meta"><time class="post-date">2025-08-04</time><span class="post-author">JEG2</span></div>

  
  


  

  <div class="post-content"><div>
        <p>
This article is part of the series <a href="https://programmersstone.blog/posts/jeg2s-questions/">JEG2&#39;s Questions</a>.</p>
<p>
do achieve product&#39;s roadmap, but don&#39;t blindly grind through tickets</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
The Best Lunch and Learn
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
<a href="https://jessitron.com/">Jessica Kerr</a>&#39;s <a href="https://www.youtube.com/watch?v=Lbcyyu8XB_Y">Forget Velocity, Let&#39;s Talk Acceleration</a> presentation</p>
<p>
Sea monsters and &#34;face eating zombies&#34;</p>
<p>
Our job isn&#39;t…, it&#39;s…</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
What&#39;s in a ticket?
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
&#34;Turn this button red&#34;</p>
<p>
Product knows:  <a href="https://www.svpg.com/books/inspired-how-to-create-tech-products-customers-love-2nd-edition/">INSPIRED:  How to Create Tech Products Customers Love</a> outcomes over features</p>
<p>
We&#39;ve got to learn to work as Product Dev</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
How the Magic Happens
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
Ask the q</p>
<p>
How would knowing change what we do?</p>
<p>
I&#39;m not telling you to use more process!  Steph&#39;s fix</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Also, Programming
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>
Observability (code, user behavior, business metrics) is vital, before you ship anything</p>
<p>
We have to enable data-driven decision making at all possible levels</p>
<p>
Angeleah&#39;s path to automation</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Pro Moves
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>
Can we make <a href="http://ribbonfarm.com/2010/07/26/a-big-little-idea-called-legibility/">Legibility</a> work for us?</p>
</div>
</div>
      </div></div>

  
    
<div class="pagination">
  <div class="pagination__title">
    <span class="pagination__title-h">Read other posts</span>
    <hr />
  </div>
  <div class="pagination__buttons">
    
    
    
      <a href="http://localhost:1313/posts/jeg2s-questions/" class="button inline next">
         [<span class="button__text">JEG2&#39;s Questions</span>] &gt;
      </a>
    
  </div>
</div>


  

  
    

  
</article>

  </div>

  
    <footer class="footer">
  <div class="footer__inner">
    
      <div class="copyright">
        <span>© 2025 Powered by <a href="https://gohugo.io">Hugo</a></span>
    
      <span>:: <a href="https://github.com/panr/hugo-theme-terminal" target="_blank">Theme</a> made by <a href="https://github.com/panr" target="_blank">panr</a></span>
      </div>
  </div>
</footer>






<script type="text/javascript" src="http://localhost:1313/bundle.min.js"></script>





  
</div>

</body>
</html>
